ninetynine_cats_project/app/models/cat_rental_request.rb

SELECT  1 AS one FROM "cat_rental_requests" WHERE (cat_id = 3) AND (start_date BETWEEN '2018-09-13' AND '2018-09-29' OR end_date BETWEEN '2018-09-13' AND '2018-09-29') AND (status = 'Approved') LIMIT $1  [["LIMIT", 1]]
---
    def does_not_overlap_approved_request
      if overlapping_approved_requests.exists?