ninetynine_cats_project/app/controllers/cat_rental_requests_controller.rb

  def create
    @cat_rental_request = CatRentalRequest.new(cat_request_params)

    if @cat_rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date") VALUES ($1, $2, $3) RETURNING "id"  [["cat_id", 3], ["start_date", "2018-09-13"], ["end_date", "2018-09-29"]]