ninetynine_cats_project/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "black"], ["description", "            \r\n    A ddddd very nice cat\r\n    "], ["updated_at", "2018-09-11 22:12:58.292208"], ["id", 4]]