ninetynine_cats_project/app/views/cat_rental_requests/new.html.erb

    <select name="cat_rental_request[cat_id]">
      <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"